<a href="https://colab.research.google.com/github/prissyyy/Studi-Independen/blob/main/11-KM05_Pandas-Library.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Kamis, 23 Sept 2021

# **Import library**

In [ ]:
import pandas as pd
import numpy as np

## Manipulating Data with Series

In [ ]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd']) # membuat 1 kolom dengan berindex a, b, c, d
s

a    3
b   -5
c    7
d    4
dtype: int64

In [ ]:
series = pd.Series([1, 0.5, 4, 5.5, 'lima']) # membuat 1 kolom yang berisi beberapa type data
series

0       1
1     0.5
2       4
3     5.5
4    lima
dtype: object

In [ ]:
ss = pd.Series([1.4, 5.6, 3, 3, 6], [1, 2, -3, 4, 5])
ss

 1    1.4
 2    5.6
-3    3.0
 4    3.0
 5    6.0
dtype: float64

### Mengambil atau memilih kolom tertentu pada series

In [ ]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [ ]:
s[~(s < 1)] # mengambil nilai, dimana negasi dari s > 1 atau s bukan > 1

a    3
c    7
d    4
dtype: int64

In [ ]:
s[(s < -1) | (s > 3)] # mengambil nilai, dimana s < -1 atau s > 3

b   -5
c    7
d    4
dtype: int64

In [ ]:
s['a'] = 6 # merubah nilai pada label a
s

a    6
b   -5
c    7
d    4
dtype: int64

In [ ]:
s.drop(['a', 'c']) # menghapus label a dan c

b   -5
d    4
dtype: int64

In [ ]:
s['b'] # memilih var s index b

-5

## Manipulating Data with Data Frame

### Membuat dataframe dari suatu series

In [ ]:
df1 = pd.DataFrame(ss)
df1

      0
 1  1.4
 2  5.6
-3  3.0
 4  3.0
 5  6.0

### Membuat dataframe dengan key dan value

In [ ]:
data = {'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brasília'], 'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### Selection

In [ ]:
df[1:] # memilih kolom 1 sampai terakhir

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [ ]:
df.iloc[[0],[0]] # memilih kolom index 0 dan kolom 0

   Country
0  Belgium

In [ ]:
df.iloc[1:,[0]] # memilih kolom 1 sampai terakhir, dan baris index ke-0

  Country
1   India
2  Brazil

In [ ]:
df.iat[0,0] # memilih baris index 0 dan kolom 0

'Belgium'

In [ ]:
df.iat[1,0] # memilih baris index 1 dan kolom 0

'India'

In [ ]:
df.loc[[0], ['Country']] # memilih baris index ke-0 pada kolom Country

   Country
0  Belgium

In [ ]:
df.loc[:,['Capital']] # memilih baris semua index pada kolom Capital

     Capital
0   Brussels
1  New Delhi
2   Brasília

In [ ]:
df.at[0,'Country'] # sama halnya dengan .loc tetapi bedanya 0 merupakan nilai skalar, jadi pengambilan nilai hanya satu

'Belgium'

In [ ]:
df.at[1,'Capital']

'New Delhi'

In [ ]:
df[df['Population'] > 1200000000] # memilih baris (atau kolom) dengan populasi >  1,2 M

  Country    Capital  Population
1   India  New Delhi  1303171035

In [ ]:
# df.ix[1,'Capital']
df.loc[1,'Capital']

'New Delhi'

In [ ]:
print(pd.__version__)

1.1.5

Atribut dan Method Data Frame lainnya

In [ ]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [ ]:
df.drop('Country', axis=1) # menghapus kolom Country

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [ ]:
df.drop([1], axis=0) # menghapus baris di index ke-1

   Country   Capital  Population
0  Belgium  Brussels    11190846
2   Brazil  Brasília   207847528

In [ ]:
df.sort_index() # mengurutkan berdasarkan index

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [ ]:
df.rank() # menentukan peringkat

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

In [ ]:
df.sort_values(by='Capital') # mengurutkan kolom Capital berdasarkan abjad

   Country    Capital  Population
2   Brazil   Brasília   207847528
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

In [ ]:
df.shape # untuk mengetahui jumlah baris dan kolom

(3, 3)

In [ ]:
df.index # untuk mengetahui index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.columns # untuk mengetahui nilai kolom

Index(['Country', 'Capital', 'Population'], dtype='object')

In [ ]:
df.info() # untuk mengetahui info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [ ]:
df.count() # menghitung jumlah elemen bukan NA / None

Country       3
Capital       3
Population    3
dtype: int64

In [ ]:
df.sum() # menentukan jumlah

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [ ]:
df.cumsum() # menentukan jumlah komulatif berdasarkan grup

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [ ]:
df.min() # menentukan nilai minimum

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [ ]:
df.max() # menentukan nilai maximum

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [ ]:
df.describe() # menampilkan statistik data

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [ ]:
df.mean() # menentukan rata-rata

Population    5.074031e+08
dtype: float64

In [ ]:
df.median() # menentukan nilai tengah

Population    207847528.0
dtype: float64

### Mengimport Data ke Data Frame

In [ ]:
#Contoh mengimport dari web
url = 'https://people.sc.fsu.edu/~jburkardt/data/csv/freshman_kgs.csv'
df2 = pd.read_csv(url)
df2

   Sex   "Weight (Sep)"   "Weight (Apr)"   "BMI (Sep)"   "BMI (Apr)"
0    M               72               59         22.02         18.14
1    M               97               86         19.70         17.44
2    M               74               69         24.09         22.43
3    M               93               88         26.97         25.57
4    F               68               64         21.51         20.10
..  ..              ...              ...           ...           ...
62   M               65               71         22.51         24.45
63   M               75               82         23.69         25.80
64   F               42               49         15.08         17.74
65   M               74               82         22.64         25.33
66   M               94              105         36.57         40.86

[67 rows x 5 columns]

In [ ]:
disney = '/content/sample_data/walt_disney_movies.csv'
data = pd.read_csv(disney)
data
# Sumber data: Kaggle

     Unnamed: 0  ...                       Screenplay by
0             0  ...                                 NaN
1             1  ...                                 NaN
2             2  ...                                 NaN
3             3  ...                                 NaN
4             4  ...                                 NaN
..          ...  ...                                 ...
439         439  ...     ['Jane Goldman', 'David Magee']
440         440  ...  ['David Lowery', 'Toby Halbrooks']
441         441  ...   ['Mikey Day', 'Streeter Seidell']
442         442  ...                      Todd Rosenberg
443         443  ...                                 NaN

[444 rows x 21 columns]

In [ ]:
data.head() 
# Fungsi head() digunakan untuk mendapatkan n baris pertama. Ini berguna untuk menguji dengan cepat apakah objek Anda- 
# memiliki tipe data yang tepat di dalamnya. Untuk nilai negatif n , fungsi head() mengembalikan semua baris kecuali 
# n baris terakhir, setara dengan df[:-n].

   Unnamed: 0                            title  ...        Edited by Screenplay by
0           0          Academy Award Review of  ...              NaN           NaN
1           1  Snow White and the Seven Dwarfs  ...              NaN           NaN
2           2                        Pinocchio  ...              NaN           NaN
3           3                         Fantasia  ...              NaN           NaN
4           4             The Reluctant Dragon  ...  Paul Weatherwax           NaN

[5 rows x 21 columns]

In [ ]:
data.tail()
# Fungsi ini mengembalikan n baris terakhir dari objek berdasarkan posisi. Ini berguna untuk 
# memverifikasi data dengan cepat, misalnya, setelah menyortir atau menambahkan baris.

     Unnamed: 0  ...                       Screenplay by
439         439  ...     ['Jane Goldman', 'David Magee']
440         440  ...  ['David Lowery', 'Toby Halbrooks']
441         441  ...   ['Mikey Day', 'Streeter Seidell']
442         442  ...                      Todd Rosenberg
443         443  ...                                 NaN

[5 rows x 21 columns]

In [ ]:
data.columns

Index(['Unnamed: 0', 'title', 'Production company', 'Country', 'Language',
       'Running time', 'Budget', 'Box office', 'Release date', 'imdb',
       'metascore', 'rotten_tomatoes', 'Directed by', 'Produced by',
       'Based on', 'Starring', 'Music by', 'Distributed by', 'Cinematography',
       'Edited by', 'Screenplay by'],
      dtype='object')

In [ ]:
data.describe

<bound method NDFrame.describe of      Unnamed: 0  ...                       Screenplay by
0             0  ...                                 NaN
1             1  ...                                 NaN
2             2  ...                                 NaN
3             3  ...                                 NaN
4             4  ...                                 NaN
..          ...  ...                                 ...
439         439  ...     ['Jane Goldman', 'David Magee']
440         440  ...  ['David Lowery', 'Toby Halbrooks']
441         441  ...   ['Mikey Day', 'Streeter Seidell']
442         442  ...                      Todd Rosenberg
443         443  ...                                 NaN

[444 rows x 21 columns]>

In [ ]:
data.dtypes

Unnamed: 0              int64
title                  object
Production company     object
Country                object
Language               object
Running time          float64
Budget                float64
Box office            float64
Release date           object
imdb                  float64
metascore             float64
rotten_tomatoes        object
Directed by            object
Produced by            object
Based on               object
Starring               object
Music by               object
Distributed by         object
Cinematography         object
Edited by              object
Screenplay by          object
dtype: object

**boleh dicoba untuk analisis data di atas yaaa....**

In [ ]:
# MENGANALISIS DATA MULAI DARI SINI

data.describe()  # menampilkan statistik data

       Unnamed: 0  Running time  ...        imdb   metascore
count  444.000000    430.000000  ...  424.000000  293.000000
mean   221.500000     98.076744  ...    6.566274   61.860068
std    128.316016     21.418924  ...    0.965122   16.756236
min      0.000000     40.000000  ...    1.500000   18.000000
25%    110.750000     86.250000  ...    6.100000   49.000000
50%    221.500000     96.000000  ...    6.600000   61.000000
75%    332.250000    107.000000  ...    7.200000   74.000000
max    443.000000    306.000000  ...    8.600000   99.000000

[8 rows x 6 columns]

In [ ]:
data.sort_values(by='Budget') # mengurutkan kolom Budget dari nilai terkecil ke terbesar

     Unnamed: 0  ...                                      Screenplay by
72           72  ...                      ['Bill Walsh', 'Don DaGradi']
379         379  ...                                                NaN
397         397  ...  ['David Fowler', 'Brian Leith', 'Phil Chapman'...
254         254  ...                                                NaN
300         300  ...            ['David L. Paterson', 'Jeff Stockwell']
..          ...  ...                                                ...
438         438  ...                                                NaN
439         439  ...                    ['Jane Goldman', 'David Magee']
440         440  ...                 ['David Lowery', 'Toby Halbrooks']
441         441  ...                  ['Mikey Day', 'Streeter Seidell']
442         442  ...                                     Todd Rosenberg

[444 rows x 21 columns]

In [ ]:
data.info() # untuk mengetahui info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 444 entries, 0 to 443
Data columns (total 21 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          444 non-null    int64
 1   title               444 non-null    object
 2   Production company  399 non-null    object
 3   Country             441 non-null    object
 4   Language            443 non-null    object
 5   Running time        430 non-null    float64
 6   Budget              278 non-null    float64
 7   Box office          358 non-null    float64
 8   Release date        435 non-null    object
 9   imdb                424 non-null    float64
 10  metascore           293 non-null    float64
 11  rotten_tomatoes     391 non-null    object
 12  Directed by         443 non-null    object
 13  Produced by         435 non-null    object
 14  Based on            221 non-null    object
 15  Starring            409 non-null    object
 16  Music by            433 non-null    object
 17  Distributed by      441 non-null    object
 18  Cinematography      352 non-null    object
 19  Edited by           404 non-null    object
 20  Screenplay by       204 non-null    object
dtypes: float64(5), int64(1), object(15)
memory usage: 73.0+ KB

In [ ]:
data.count() # hanya menghitung jumlah elemen selain NA / None

Unnamed: 0            444
title                 444
Production company    399
Country               441
Language              443
Running time          430
Budget                278
Box office            358
Release date          435
imdb                  424
metascore             293
rotten_tomatoes       391
Directed by           443
Produced by           435
Based on              221
Starring              409
Music by              433
Distributed by        441
Cinematography        352
Edited by             404
Screenplay by         204
dtype: int64

##ThankYou